# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [9]:
import pandas as pd
from urllib.error import HTTPError

url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

try:
    cars = pd.read_csv(url, sep='|', index_col='user_id')
except HTTPError as e:
    print(f"An HTTP error occurred: {e}")

### Step 4. See the first 25 entries

In [14]:

url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

cars = pd.read_csv(url, sep='|', index_col='user_id')

cars.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 5. See the last 10 entries

In [15]:
cars.tail(1)

         age gender occupation zip_code
user_id
943       22      M    student    77841

### Step 6. What is the number of observations in the dataset?

In [16]:
cars.shape[0]

943

### Step 7. What is the number of columns in the dataset?

In [17]:
cars.shape[1]

4

### Step 8. Print the name of all the columns.

### Step 9. How is the dataset indexed?

### Step 10. What is the data type of each column?

### Step 11. Print only the occupation column

### Step 12. How many different occupations are in this dataset?

In [31]:
cars.columns.to_list
unique_occupations = cars['occupation'].unique()
num_unique_occupations = cars['occupation'].nunique()
occupation_counts = cars['occupation'].value_counts()
occupation_counts

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64

### Step 13. What is the most frequent occupation?

In [24]:
cars['occupation'].value_counts().index[0]

'student'

### Step 14. Summarize the DataFrame.

In [29]:


cars.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Step 15. Summarize all the columns

In [32]:
cars.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 16. Summarize only the occupation column

In [33]:
cars['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [35]:
cars.columns
cars['age'].mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [45]:
# Calculate the counts of each unique age
age_counts = cars['age'].value_counts()

# Find the minimum count
min_count = age_counts.min()

# Filter the ages that have the minimum count
ages_with_least_occurrence = age_counts[age_counts == min_count]

# Print the age(s) with the least occurrence
print("Age(s) with the least occurrence:")
print(ages_with_least_occurrence)

Age(s) with the least occurrence:
age
7     1
66    1
11    1
10    1
73    1
Name: count, dtype: int64